# GetProjectName

## Description
Gets the name of the Project File for Project Sharing.

```pascal
FUNCTION GetProjectName(VAR name : STRING) : BOOLEAN;
```

```python

def vs.GetProjectName():
    return (BOOLEAN, name)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING||

## Returns
Returns True on success, False on failure or if not Project Sharing

## Version
Availability: from Vectorworks 2021
## Category
* Project Sharing